28-css-grids-lecture/rails-quest/app/controllers/responses_controller.rb

    def define_question
        @question = Question.order("RANDOM()").limit(1)[0]
---
SELECT  "questions".* FROM "questions" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]

    def create
        # declare a variable to hold the incrementing correct count
        # @number_correct = 0
        # if !cookies[:number_correct]
        #     cookies[:number_correct] = 0
        # end
        session[:number_correct] ||= 0
        # byebug
        response = Response.create(response_params)
---
INSERT INTO "responses" ("question_id", "answer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["question_id", 24], ["answer_id", 96], ["created_at", "2019-07-29 06:02:21.591219"], ["updated_at", "2019-07-29 06:02:21.591219"]]