32-js-code-review/backend/app/controllers/dancers_controller.rb

  def index
    dancers = Dancer.all
---
SELECT "dancers".* FROM "dancers"

  def show
    dancer = Dancer.find(params[:id])
---
SELECT "dancers".* FROM "dancers" WHERE "dancers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    dancer = Dancer.new(dancer_params)

    if dancer.save
---
INSERT INTO "dancers" ("url", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)