32-js-code-review/backend/app/controllers/feedback_controller.rb

  def create
    feedback = Feedback.new(feedback_params)

    if feedback.save
---
INSERT INTO "feedback" ("content", "dancer_id") VALUES (?, ?)  [["content", "testing post request to feedback"], ["dancer_id", 1]]