27-sessions-cookies/trivia/app/controllers/responses_controller.rb

    def define_question
        @question = Question.order("RANDOM()").limit(1)[0]
---
SELECT  "questions".* FROM "questions" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]

    def create
        # cookies[:number_correct] ||= 0
        if !session[:number_correct]
            session[:number_correct] = 0
        end
        response = Response.create(response_params)
---
INSERT INTO "responses" ("question_id", "answer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["question_id", 17], ["answer_id", 68], ["created_at", "2019-11-11 23:51:44.644300"], ["updated_at", "2019-11-11 23:51:44.644300"]]